from sound import song,sing, export, compose

from pydub.playback import play

# sing('C',300,'5_ 5_ 6 5 1^ 7_ 7_ 7 5_ 5_ 6 5 2^ 1^-')
# sing('C', 200, '3^ 3^b 2^ 2^b 1^ 7 7b 6 6b 5 5b 4 3 3b 2 2b 1 1# 2 2# 3 4 4# 5 5# 6 6# 7 1^ 1^# 2^ 2^# 3^ 4^')
# sing('D', 120, '5v_ 1 1 3 3 1- 5v. 5v_ 5v- 2_ 1_ 7v_ 6v_ 5v-- 0')
# sing('C',200,'4v 5v 6v 7v 1')
# sing("C",143,"1 2 3 4# 5 6 7 1^# 5 6 7 1^ 1 2 3 4# 5# 6 7 5 6 7 1^__ 0_ ")
# sing('C',66,'4v 4#v 5v 5#v 6v 6#v 7v 1 1# 2 2# 3 3# 4 4# 5 5# 6 6# 7 1^ 1#^ 2^ 2#^ 3^ 3#^ 4^ 4#^ 5^ 6^ 7^ ')
# test()

# sing('B', 120,'1 2 3 4 5 6 7 1^ 7 6 5 4 3 2 1 ')

#  sing('B',133,'7v- 1 2 3 4 5 6 7- 6 5 4 3 2 1 7v---')

# sing('C',60,'4v 4v# 5v 5v# 6v 6#v 7v 1 1# 2 2# 7v 7vb 6v 6bv 5v 5bv 4v ')

song('晨歌').export('晨歌-2',tn=2)#.sing()
# song('C大调小曲').sing()
# song('巴黎假日').sing()
# song('早晨心情').sing()
# song('小狗圆舞曲').sing()
# song('亚麻色头发的少女').sing()
# sing('C',60,'1 2 3  4 5 5#  7b ')
# sing('C',60, '1,3,5- 2,4,6- 3,5,7- 4,6,1^- 5,7,2^- 6,1^,3^- 7,2^,4^-')
# sing('B',100,'4v 5v 6v 7v 1 2 3 4 5 6 7 1^ 2^ 3^ 2^ 1^ 7 6 5 4 3 2 1 7v 6v 5v 4v ')
